// Copyright (c) 2011 The Chromium OS Authors. All rights reserved.
// Use of this source code is governed by a BSD-style license that can be
// found in the LICENSE file.

/* Menus */
"Menu About" = "Tietoja Chrome OS Image Creatorista";
"Menu Prefs" = "Asetukset…";
"Menu Services" = "Palvelut";
"Menu Hide" = "Piilota Chrome OS Image Creator";
"Menu Hide Others" = "Piilota muut";
"Menu Show All" = "Näytä kaikki";
"Menu Quit" = "Sulje Chrome OS Image Creator";
"Menu Window" = "Ikkuna";
"Menu Minimize" = "Pienennä";
"Menu Zoom" = "Zoomaa";
"Menu Bring All To Front" = "Tuo kaikki etualalle";
"Menu Help" = "Ohje";
"Menu App Help" = "Chrome OS Image Creator -ohje";

/* Buttons */
"Button Previous" = "Edellinen";
"Button Next" = "Seuraava";
"Button Stop" = "Pysäytä";
"Button Done" = "Valmis";

/* Tab: Select device model */
"Text Welcome" = "Tämän työkalun avulla voit luoda Chrome-käyttöjärjestelmän palauttamista varten tarvittavan SD-kortin tai USB-muistitikun.\n\nAnna Chrome-käyttöjärjestelmälaitteesi mallinumero (esim. SAMS ALEX BETA-US 8738). Se näkyy alalaidassa ruudussa, jossa sinua pyydetään yhdistämään palautuslaite.";
"Text Model" = "Malli:";
"Button Local Image" = "Paikallinen näköistiedosto…";

/* Tab: Select USB stick */
"Text Select Prompt" = "Valitse palauttamiseen käytettävä tallennuslaite:";
"Text Insertion Prompt" = "Aseta SD-kortti tai USB-muistitikku.";

/* Tab: Done */
"Text Congrats" = "Tietoväline on valmis. Voit nyt irrottaa tallennuslaitteen ja palauttaa sen avulla laitteesi Chrome-käyttöjärjestelmän.";

/* Sizes */
"Size Bytes" = " tavua";
"Size Kilobytes" = " Kt";
"Size Megabytes" = " Mt";
"Size Gigabytes" = " Gt";
"Size Terabytes" = " Tt";
"Size Petabytes" = " Pt";

/* Error starting Disk Arbitration. */
"NoDiskArb Message" = "Sovellusta ei voi suorittaa.";
"NoDiskArb Informative" = "Levyn välitystä aloitettaessa esiintyi ongelma. Tätä ei tulisi tapahtua.";
"NoDiskArb OK" = "OK";

/* Error retrieving config file. */
"CantGetConfig Message" = "Näköistiedostojen luetteloa ei voi noutaa.";
"CantGetConfig Informative" = "Ongelma noudettaessa saatavilla olevien palautusnäköistiedostojen luetteloa (%1$@). Varmista, että verkkoyhteys on käytettävissä.";
"CantGetConfig OK" = "OK";
"CantGetConfig Error NoConnection" = "yhteyttä ei voi muodostaa";
"CantGetConfig Error DownloadError" = "latauksen aikana tapahtui virhe";
"CantGetConfig Error StringCreate" = "vastausta ei voi käyttää";

/* Version error. */
"VersionError Message" = "Sovellusversio on liian vanha.";
"VersionError Informative" = "Lataa uudempi versio. Käytössä on versio %1$@, tarvitaan vähintään versio %2$@. %3$@";
"VersionError OK" = "Hanki uusi versio";

/* File dialog to select a local file. */
"SelectLocal File" = "Valitse näköistiedosto:";
"SelectLocal Button" = "Valitse";

/* Alert on writing stick. */
"WriteAlert Message" = "Haluatko varmasti poistaa kaikki tiedostot laitteelta %1$@ pysyvästi?";
"WriteAlert Informative" = "Kaikki laitteella olevat tiedot menetetään. Tätä toimintoa ei voi peruuttaa.";
"WriteAlert Cancel" = "Älä poista";
"WriteAlert OK" = "Poista";

"TooSmallAlert Message" = "Laitetta %1$@ ei voi käyttää, sillä on liian vähän tallennustilaa.";
"TooSmallAlert Informative" = "SD-kortilla tai USB-muistitikulla täytyy olla vähintään %2$@ tallennustilaa.";
"TooSmallAlert OK" = "OK";

"NotWritable Message" = "Laitetta %1$@ ei voi käyttää, se on vain luku -tilassa.";
"NotWritable Informative" = "SD-kortti tai USB-muistitikku on vain luku -tilassa. Laitteessa voi olla kytkin, jonka avulla sen tilaa voi vaihtaa. Laitetta ei voi käyttää tässä tilassa.";
"NotWritable OK" = "OK";

"Label SD Card" = "SD-kortti";

/* Stick writing statuses. */
"Status Downloading" = "Ladataan…";
"Status Verifying Image" = "Tarkistetaan palautusnäköistiedostoa…";
"Status Unpacking" = "Puretaan…";
"Status Claiming" = "Otetaan käyttöön…";
"Status Unmounting" = "Poistetaan käytöstä…";
"Status Writing" = "Kirjoitetaan…";
"Status Verifying Media" = "Tarkistetaan palautustietovälinettä…";
"Status Ejecting" = "Irrotetaan…";
"Status Done" = "Valmis!";

"StatusAdd Attempt" = " (yritys %1$d)";

/* Errors */
"Failure Downloading" = "Tapahtui virhe (lähdenäköistiedoston lataaminen epäonnistui). Yritetäänkö uudelleen?";
"Failure Verifying Return Value" = "Tapahtui virhe (lähdenäköistiedoston vahvistaminen epäonnistui, ohjelmavirhe, %1$s). Yritetäänkö uudelleen?";
"Failure Verifying SHA Mismatch" = "Tapahtui virhe (lähdenäköistiedoston vahvistaminen epäonnistui, tarkistussummavirhe). Yritetäänkö uudelleen?";
"Failure Unpacking" = "Tapahtui virhe (lähdenäköistiedoston purkaminen epäonnistui, %1$s). Yritetäänkö uudelleen?";
"Failure Claiming" = "Tapahtui virhe (USB-tikun käyttöön ottaminen epäonnistui). Yritetäänkö uudelleen?";
"Failure Unmounting" = "Tapahtui virhe (USB-tikun käytöstä poistaminen epäonnistui). Yritetäänkö uudelleen?";
"Failure Opening Source Image" = "Tapahtui virhe (lähdenäköistiedoston avaaminen epäonnistui, %1$s). Yritetäänkö uudelleen?";
"Failure Opening Destination Device" = "Tapahtui virhe (USB-tikun avaaminen epäonnistui, %1$s). Yritetäänkö uudelleen?";
"Failure Reading Source Image" = "Tapahtui virhe (lähdenäköistiedoston lukeminen epäonnistui, %1$s). Yritetäänkö uudelleen?";
"Failure Writing Destination Device" = "Tapahtui virhe (tietojen tallentaminen USB-tikulle epäonnistui, %1$s). Yritetäänkö uudelleen?";
"Failure Reading Destination Device" = "Tapahtui virhe. USB-tikkua %1$s ei voi lukea. Haluatko yrittää uudelleen?";
"Failure Resetting Source Image" = "Tapahtui virhe. Lähdenäköistiedostoa %1$s ei voi käyttää. Haluatko yrittää uudelleen?";
"Failure Resetting Destination Device" = "Tapahtui virhe. USB-tikkua %1$s ei voi käyttää. Haluatko yrittää uudelleen?";
"Failure Ejecting" = "Tapahtui virhe (USB-tikun irrottaminen epäonnistui). Yritetäänkö uudelleen?";

"Failure Try Again" = "Yritä uudelleen";
"Failure Quit" = "Sulje";

"Failure Termination Status" = "Sulkemisen tila %d";

"Failure Internal Error 1" = "Odottamaton EOF";
